import unittest
from src.article_analysis import analysis
from src import log


# class MyTestCase(unittest.TestCase):
#     def test_something(self):
#         self.assertEqual(True, False)  # add assertion here


if __name__ == '__main__':
    text = """Народний депутат "Слуги народу" Олександр Трухін визнав, що пропонував хабар поліцейському. Він пішов на угоду зі слідством, пише УП з посиланням на засідання у Вищому антикорупційному суді. 

"Я хочу повідомити суд і інших учасників судовго засідання, що була надіслана угода про визнання винуватості, яка підписана між мною... та обвинуваченим Трухіним... Ми дійшли згоди, що дійсно ця угода буде відповідати суспільному інтересу, зважаючи на те, що Трухін як народний депутат за час війни не втік, не вживав якихось антиукраїнських заходів, а навпаки займав проукраїнську позицію. Він багато надавав документів, де він брав часть, у яких заходах на міжнародному рівні", – заявив прокурор. 

Угоду зі слідством має затвердити суд. Якщо це відбудеться, він втратить мандат народного депутата. За даними журналістів, на вибір санкції вплинула наявність у нардепа двох дітей і заохочень від державних органів.

Угода між Трухіним та Спеціалізованою антикорупційною була укладена 17 лютого. Трухін має протягом місяця переказати 6 млн гривень на підтримку ЗСУ. Прокурор вважає, що таким чином нардеп підтвердить "каяття". Також "слуга" має заплатити штраф – 68 тисяч гривень. Це максимальна сума штрафу за статтею, яку інкримінують Трухіну.

Під час укладання угоди Трухін розповів, за що саме він пропонував хабар – за те, щоб найскоріше залишити місце ДТП. Прокурор наголосив, що ця угода жодним чином не стосується участі "слуги" в самій аварії.

Нагадаємо, Трухін обвинувачується за ч. 1 ст. 369 КК України. Санкція статті передбачає покарання у виді штрафу від 1000 (17 000 грн) до 4000 неоподатковуваних мінімумів доходів громадян або обмеження волі на строк від двох до чотирьох років, або позбавлення волі на той самий строк.

Аварія за участі депутата "Слуги народу" трапилася на Бориспільській трасі 23 серпня 2021 року. Постраждали шестеро осіб, зокрема і двоє дітей та голова Комітету арбітрів Федерації футболу України. Низка ЗМІ оприлюднила інформацію про те, що за кермом Audi, яка врізалася в Ford (той, своєю чергою, влетів у Daewoo), був Трухін, однак потім цю інформацію видалили.

2 жовтня генеральна прокурорка України Ірина Венедіктова заявила, що у справі ДТП народного депутата Олександра Трухіна нічого не замовчується. 1 лютого "Українська правда" опублікувала відео з ДТП за участі народного депутата від "Слуги народу" Олександра Трухіна. На відео Трухін звертається до поліцейського зі словами "давай я тихенько в ліс піду", а потім обіцяє "поговорити" з очільником МВС Денисом Монастирським.

Після публікації відео журналістами очільник фракції Давид Арахамія закликав його самостійно вийти зі складу фракції. Арахамія сказав, що він із колегами чекав "офіційних і переконливих результатів розслідування ДТП". 

МВС також оприлюднило заяву після публікації журналістами відео. В міністерстві заявили, що "всі намагання представляти суть справи так, що нібито народний депутат України О. Трухін про щось намагався «домовитись» із Міністром внутрішніх справ України, не відповідають дійсності". 

2 лютого 2022 Трухіна виключили з партії "Слуга народу". Тільки 7 вересня Трухін попросив припинити його повноваження як члена фракції. Після оголошення підозри в вересні цього року Трухіну обрали запобіжний захід у вигляді 49, 6 тисяч гривень. 

Справу проти Трухіна щодо хабаря скерували до суду в грудні. """
    analysis(text.strip())
