import logging
import os

LOGGER_NAME = "sillybaka"

# TODO: The path for the temp folder shouldn't be hardcoded. For now changing the location of helper_stuff.py file needs
#  special attention to change the location of the root folder
TEMP_PATH = "/".join(__file__.split("/")[:-1])
os.makedirs(TEMP_PATH+"/temp", exist_ok=True)
# For topic filtering
# TOPIC_KEYWORDS = (
#     'розтрата бюджетних коштів', 'кумівство', 'привласнення', 'прозорість діяльності', 'недостовірні дані',
#     'захист інтересів', 'злочинець', "родинні зв'язки", 'економічні правопорушення', 'внутрішні розслідування',
#     'спонсорство', 'громадська безпека', 'зловживання правом', 'зловживання активами', 'корупційні дії',
#     'незаконні прибутки', 'розкриття інформації', 'приватні активи', 'офіційний контроль', 'правова відповідальність',
#     'порушення прав', 'державні фінанси', 'інсайдер', 'таємні платежі', 'антикорупційний аудит', 'державні органи',
#     'корупційна схема', 'корупційні схеми', 'підкуп', 'державна зрада', 'відшкодування', 'антикорупційна політика',
#     'позовна діяльність', 'спеціальні витрати', 'підробка документів', 'секретна інформація',
#     'зловживання службовим становищем', 'конфлікт інтересів', 'непрозорі договори', 'службові зловживання',
#     'розкрадання активів', 'нецільове використання коштів', 'незаконна вигода', 'службовий злочин', 'розслідування',
#     'розтратники', 'захист прав', 'антикорупційний захист', 'підозра', 'економічна злочинність',
#     'корупційна діяльність',
#     'державне регулювання', 'державний апарат', 'корупційні угоди', 'відмивання', 'розкрадання фондів',
#     'фінансова відповідальність', 'секретні рахунки', 'зловживання владою', 'державні інститути', 'хабарництво',
#     'незаконне привласнення', 'незаконне використання', 'правопорушення', 'громадські активи', 'хабарники',
#     'неправомірна вигода', 'злочини проти держави', 'незалежний аудит', 'бенефіціар', 'контрабанда', 'державна служба',
#     'приватизація', 'кримінальний елемент', 'благодійні фонди', 'офшорна діяльність', 'державні послуги',
#     'економічні злочини', 'прямий вплив', 'комерційні угоди', 'посадова особа', 'незаконні угоди',
#     'незаконна діяльність',
#     'офшорні рахунки', 'тіньовий ринок', 'таємний фонд', 'лобіювання', 'державні ресурси', 'незаконні дотації',
#     'посадовці',
#     'кримінальні схеми', 'незаконне фінансування', 'розкрадання фінансів', 'антикорупційні дії', 'корупційні ризики',
#     'антикорупційна діяльність', 'дотримання вимог', 'фальсифікація', 'розтрата', 'розкрадання ресурсів',
#     'відмивання грошей', 'обман', 'державні інтереси', 'зловживання', 'незаконний вплив', 'дискримінація',
#     'фінансові порушення', 'провокація злочину', 'державні структури', 'хабар', 'недобросовісні дії',
#     'державне управління',
#     'надання послуг', 'маніпуляції з документами', 'справи про корупцію', 'зловживання повноваженнями',
#     'державне фінансування', 'безпека активів', 'тіньова економіка', 'бюрократичні злочини', 'корупція',
#     'державна підтримка', 'таємні угоди', 'антикорупційні заходи', 'недержавні фінанси', 'недбалість',
#     'службова недбалість', 'державний борг', 'комісійні', 'державні установи', 'правове регулювання',
#     'корупційні злочини',
#     'незаконне збагачення', 'захоплення ресурсів', 'корупційний скандал', 'державний бюджет', 'громадські інтереси',
#     'влада', 'незаконні дії', 'посадовий злочин', 'недотримання етики', 'шахрайство', 'недекларовані активи',
#     'секретні операції', 'корупційна змова', 'прозорість витрат', 'порушення законодавства', 'розслідування справ',
#     'державне правопорушення', 'державний аудит', 'декларування', 'корупційна політика', 'іноземні активи',
#     'професійна етика', 'державні фонди', 'корупціонер', 'державна політика', 'фінансовий контроль', 'офіційні особи',
#     'офшорні угоди', 'управління активами', 'незаконні схеми', 'декларування активів', 'антикорупційний комітет',
#     'прозорість', 'таємні операції', 'захист громадян', 'недостатній контроль', 'недоцільні витрати',
#     'кримінальна відповідальність', 'таємні рахунки', 'антикорупційна служба')

TOPIC_KEYWORDS = ['фінансові махінації', 'розтрата бюджетних коштів', 'підозра на корупційне діяння', 'угода', 'службове підроблення',
    'злочинець', 'відмова у перевірці', 'відмивання активів', 'маніпуляції з податками',
    'незаконне управління активами',
    'незаконні витрати', 'фіктивне планування', 'протизаконна власність', 'незаконне управління коштами',
    'неправомірне використання ресурсів', 'державні змови', 'незадекларовані активи', 'перекваліфікація',
    'незаконний обіг коштів', 'корупційна схема', 'обвинувачення', 'державна зрада', 'підозрюється', 'корупційний',
    'підкуп', 'розтрати', 'маніпуляції бюджетом', 'відчуження майна', 'порушення порядку декларування',
    'порушення процедури закупівель', 'зловживання службовим становищем', 'злочин', 'отримання підозрілих коштів',
    'отримання вигоди', 'незаконна вигода', 'зловживання довірою', 'неправомірне рішення суду',
    'порушення правопорядку']

log = logging.getLogger(LOGGER_NAME)
log.setLevel(logging.DEBUG)
log.addHandler(logging.StreamHandler())
